TestEDT/src/Catalogs/МаскаЛицевогоСчета/МаскаЛицевогоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаскаЛицевогоСчета</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаПредставленияСчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыАналитик</name>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TestEDT/src/InformationRegisters/НастройкаАналитикиЛицевыхСчетовЕПС/НастройкаАналитикиЛицевыхСчетовЕПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаАналитикиЛицевыхСчетовЕПС</name>
  <resources>
    <name>Аналитика1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </resources>
  <resources>
    <name>МаскаЛицевогоСчета</name>
    <type>
      <types>CatalogRef.МаскаЛицевогоСчета</types>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.ЕПС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/Catalogs/МаскаЛицевогоСчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

#Область ОБРАБОТЧИКИ_СОБЫТИЙ 

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Или ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Если Не Справочники.МаскаЛицевогоСчета.СинтаксическийКонтрольШаблонаПройден(Шаблон) Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.КлючДанных = Ссылка;
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "Шаблон";
		Сообщение.Текст = "Синтаксический контроль шаблона не пройден";
		Сообщение.Сообщить(); 

		Отказ = Истина;	
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда 
		ПроверкаВозможностиИспользованияВидовАналитики(Отказ);
	КонецЕсли;
	
	ПредставлениеЛицевогоСчета = СтрЗаменить(ПредставлениеЛицевогоСчета, " ", "");
	
	ВидыАналитик.Свернуть("ВидАналитики");
	
КонецПроцедуры

#КонецОбласти

#Область ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_ФУНКЦИИ 

Процедура ПроверкаВозможностиИспользованияВидовАналитики(Отказ)
	
	ТаблицаНастроекИспользующихМаску = ТаблицаНастроекИспользующихМаску();
	
	Для Каждого СтрокаВидовАналитикиМаски из ВидыАналитик Цикл
		ВидАналитикиМаски = СтрокаВидовАналитикиМаски.ВидАналитики;
		
		Для Каждого СтрокаАналитики Из ТаблицаНастроекИспользующихМаску Цикл
			Если  СтрокаАналитики.Аналитика1 <> ВидАналитикиМаски 
				И СтрокаАналитики.Аналитика2 <> ВидАналитикиМаски 
				И СтрокаАналитики.Аналитика3 <> ВидАналитикиМаски 
				И СтрокаАналитики.Аналитика4 <> ВидАналитикиМаски 
				И СтрокаАналитики.Аналитика5 <> ВидАналитикиМаски Тогда 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.КлючДанных = Ссылка;
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Поле = "ВидыАналитики";
				Сообщение.Текст = "Невозможно использовать вид аналитики <"+ ВидАналитикиМаски +">, т.к. данная маска используется в счетах, где нет такого вида аналитики";
				Сообщение.Сообщить(); 
				
				Отказ = Истина;
				
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаНастроекИспользующихМаску()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаАналитикиЛицевыхСчетовЕПС.Аналитика1,
		|	НастройкаАналитикиЛицевыхСчетовЕПС.Аналитика2,
		|	НастройкаАналитикиЛицевыхСчетовЕПС.Аналитика3,
		|	НастройкаАналитикиЛицевыхСчетовЕПС.Аналитика4,
		|	НастройкаАналитикиЛицевыхСчетовЕПС.Аналитика5
		|ИЗ
		|	РегистрСведений.НастройкаАналитикиЛицевыхСчетовЕПС КАК НастройкаАналитикиЛицевыхСчетовЕПС
		|ГДЕ
		|	НастройкаАналитикиЛицевыхСчетовЕПС.МаскаЛицевогоСчета = &МаскаЛицевогоСчета";
	Запрос.УстановитьПараметр("МаскаЛицевогоСчета", Ссылка);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти


#КонецЕсли
